Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: རྟེན་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཉོན་མོངས་པ་མེད་པའོ། །གཡོས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྟེན་པ་མེད་པའོ། །ཆགས་པ་མེད་པར་འཇུག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཡོ་བ་མེད་པའོ། །སྒྲིབ་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཆགས་པ་མེད་པར་འཇུག་པའོ། །ནམ་མཁའ་དང་མཚུངས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྒྲིབ་པ་མེད་པའོ། །རྣམ་པར་རྟོག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་དང་མཚུངས་པའོ། །རྒྱུ་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟུགས་ཅན་མ་ཡིན་པའོ། །སྣང་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བསྟན་དུ་མེད་པའོ། །སྣང་བ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྣང་བ་མེད་པའོ། །མི་མཉམ་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མཉམ་པ་མེད་པའོ། །ནམ་མཁའ་དང་མཚུངས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མི་མཉམ་པ་མེད་པའོ། །གསལ་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མུན་པ་མེད་པའོ། །གཉེན་པོ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྣང་བ་མེད་པའོ། །ལྟུང་བ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཁ་ན་མ་ཐོ་བ་མེད་པའོ། །ལས་བྱས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཁ་ན་མ་ཐོ་བ་མེད་པའོ། །
en: “All phenomena are without afflictive emotions because they lack support, without support because they lack deception, without deception because they enter nonattachment, entering into nonattachment because they are unobscured, unobscured because they are like space, like space because they are without conceptuality, immaterial because they are motionless, indemonstrable because they do not appear, nonappearing because they are free of appearance, without similarity on account of lacking dissimilarity, without dissimilarity because they are like space, without darkness because they lack luminosity, without appearance because they are beyond remedies, beyond contemptibility because they are beyond wrongdoing, and beyond contemptibility because they do not perform actions.

source: བརྫུན་པ་སླུ་བའི་ཆོས་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཇི་ལྟ་བ་བཞིན་དུ་མ་ཡིན་པའོ། །
en: All phenomena are not in accordance with reality because they are deceptive fictions.

source: གཟོད་མ་ནས་གནས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཕྱེ་བ་མེད་པའོ། །
en: They lack differentiation because they are primordially present.

source: གཟུགས་ཅན་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ལྟ་བ་པོ་མེད་པའོ། །སྒྲ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཉན་པ་པོ་མེད་པའོ། །
en: “All phenomena lack spectators because they are formless, are without an audience because they are soundless;

source: དྲི་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྣོམ་པ་པོ་མེད་པའོ། །རོ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མྱང་བ་པོ་མེད་པའོ། །རེག་བྱ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རེག་པ་པོ་མེད་པའོ། །ཆོས་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་ཤེས་པ་པོ་མེད་པའོ། །སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་དམིགས་པ་མེད་པའོ། །
en: they are without a perceiver of smell because they are odorless, without a perceiver of taste because they are without taste, without a perceiver of touch because they are intangible, without a perceiving consciousness because they are not phenomena, and without objectification because they are beyond mind, mental activity, and consciousness;

source: བྱང་ཆུབ་དང་མཚུངས་ཤིང་འདྲ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ། །གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ། །
en: and they are inconceivable because they are like awakening, and they have primordially transcended sorrow because they are primordially unborn.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་སྒྲ་དབྱངས་རྣམ་པར་དག་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཡི་གེའི་དང་པོ་ཨ་ཞེས་བྱ་བ་ཡོངས་སུ་རྗོད་པ་ན་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་ཆོས་སྟོན་ཀྱང་ཡི་གེ་ཨ་ཞེས་བྱ་བའི་སྒྲ་མི་འདོར་བར་སྟོན་ཏོ། །
en: “In this way, son of noble family, as the bodhisattvas utter the primary letter a, because they have attained the pure melody dhāraṇī their teaching of the Dharma goes on for an eon or more without the sound of the letter a ever being lost.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡི་གེ་ཐམས་ཅད་ཀྱི་ནང་ནས་ཡི་གེ་གང་དང་གང་གིས་ཆོས་སྟོན་པར་རྩོམ་པའི་ཡི་གེ་དེ་དང་དེ་ཟད་པར་མི་འགྱུར་རོ། །
en: In the same way, any letter among all the letters used to teach the Dharma will not dissipate.

source: རྒྱུན་ཆད་པ་མེད་པར་ཆོས་ཀྱི་ཚུལ་དོན་དང་ཚིག་འབྲུ་དང་ལྡན་པ་སྟོན་ཏོ། །
en: They teach the Dharma, in word and meaning, unceasingly.

source: གཟུངས་འདི་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྤྱོད་ལམ་གྱིས་ལུས་རྣམ་པར་དག་པ་ཡིན་ནོ། །སྤོབས་པས་ངག་རྣམ་པར་དག་པ་ཡིན་ནོ། །བྱམས་པ་སྒོམ་པས་སེམས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: “With regard to bodhisattvas established in this dhāraṇī, their bodies are pure due to their behavior, their speech is pure due to their eloquence, and their minds are pure due to their cultivation of love.

source: ཆོས་དང་ཟང་ཟིང་སྦྱིན་པ་ལ་སེར་སྣ་མེད་པས་སྦྱིན་པ་རྣམ་པར་དག་པ་ཡིན་ནོ། །ཚུལ་ཁྲིམས་ཉམས་པ་མེད་པས་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their generosity is pure due to the absence of miserliness in making gifts of the Dharma and material wealth. Their morality is pure because there is no degeneration in their discipline.

source: ཞེ་འགྲས་པའི་སེམས་མེད་པས་བཟོད་པ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their patience is pure due to the absence of animosity.

source: ལེགས་པར་བྱེད་པའི་ལས་བྱེད་པས་བརྩོན་འགྲུས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their vigor is pure due to their performance of virtuous actions.

source: དེ་ལ་མ་ཆགས་པས་བསམ་གཏན་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their concentration is pure because they are unattached.

source: ཡེ་ཤེས་ཀྱི་སྣང་བ་རབ་རིབ་མེད་པས་ཤེས་རབ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their insight is pure because the light of their wisdom is without darkness.

source: ཁ་ན་མ་ཐོ་བ་མེད་པས་ལས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their behavior is pure due to an absence of contemptible acts.

source: ལྷའི་མིག་ཡོངས་སུ་དག་པས་མིག་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: “Their eyes are pure due to the purity of their divine vision.

source: ལྷའི་རྣ་བ་ཐོབ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཆོས་བསྟན་པ་ཉན་པས་རྣ་བ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their ears are pure due to attaining the divine ear and listening to the Dharma discourses of all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་དྲི་ལ་སྣོམ་པའི་ཕྱིར་སྣ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their noses are pure because they perceive the fragrance of the tathāgatas’ discipline.

source: རོ་ཞིམ་པོ་ལ་བརྐམ་པ་མེད་པའི་ཕྱིར་ལྕེ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their tongues are pure due to an absence of thirst for delicious taste.

source: རྫུས་ཏེ་སྐྱེ་བས་མངལ་གྱི་དྲི་མས་མི་གོས་པའི་ཕྱིར་ལུས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their bodies are pure because they are born miraculously and unstained by the impurities of a womb.

source: ཆོས་རབ་ཏུ་འབྱེད་པ་ལ་མཁས་པས་སེམས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Their minds are pure because they are skilled in distinguishing phenomena.

source: མཚན་གྱིས་ལེགས་པར་བརྒྱན་པས་གཟུགས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: “For them, form is pure because they are well adorned by signs.

source: ཡིད་དུ་འོང་བའི་སྒྲ་རྗོད་པས། སྒྲ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Sound is pure because they articulate pleasing speech.

source: ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། གཏོང་བའི་དྲིས་ཡོངས་སུ་བསྒོས་པས། དྲི་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Scent is pure because they are draped in the fragrance of discipline, learning, and generosity.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་རོ་བྲོ་བའི་མཆོག་ཐོབ་པས། རོ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Taste is pure because they have attained the supreme taste, the sign of a great being.

source: འཇམ་ཞིང་མཉེན་པའི་རྐང་ལག་ཐོབ་པས། རེག་པ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Touch is pure because they have attained smooth and pliant limbs.

source: ཆོས་ལ་སྣང་བ་ཐོབ་པས་ཆོས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Phenomena are pure because they have attained the illumination of the Dharma.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་མ་བརྗེད་པས་དྲན་པ་རྣམ་པར་དག་པ་ཡིན་ནོ། །བདུད་ཀྱི་ལམ་ལས་ཤིན་ཏུ་འདས་པས་བློ་གྲོས་རྣམ་པར་དག་པ་ཡིན་ནོ། །ཆོས་ཟབ་མོ་རྟོགས་པར་ཁོང་དུ་ཆུད་པས་རྟོགས་པ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: Likewise, their mindfulness is pure because they have not forgotten the dharmas they have heard, their intelligence is pure because they have completely transcended the works of Māra, and their realization is pure because they have internalized the realization of the profound Dharma.

source: གཟུངས་འདི་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་སྙེད་སྒྲས་གོ་བར་བྱེད་པ་དེ་སྙེད་འོད་ཀྱིས་རྒྱས་པར་འགེངས་སོ། །
en: “Bodhisattvas established in this dhāraṇī pervade with light as many buddhafields as have understood its sound.

source: འདི་ལྟ་སྟེ། གཟུངས་འདི་ཉིད་ཀྱི་མ་འདྲེས་པའི་ཁྱད་པར་རབ་ཏུ་ཐོབ་པས་འོད་དེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པའི་ཆོས་ཀྱི་ཚུལ་འབྱུང་བར་བྱེད་དོ། །
en: That is to say, due to the attainment of the exceptional uniqueness of this very dhāraṇī, this light causes the Dharma taught by all the buddhas of the ten directions to manifest.

source: རིགས་ཀྱི་བུ་སྒྲ་དབྱངས་རྣམ་པར་དག་པའི་གཟུངས་འདི་ནི་གང་ཆུང་ཟད་གཞོལ་བར་འཇུག་པ་སྟེ།
en: “Son of noble family, this pure melody dhāraṇī is introduced only concisely here.

source: སྒྲ་དབྱངས་རྣམ་པར་དག་པའི་གཟུངས་འདི་བསྟན་པ་ནི་ཚད་མེད་དེ།
en: The teaching on this dhāraṇī of pure melody is immeasurable.

source: ཡི་གེ་རྣམ་པར་ཕྱེ་བས་བསམ་གྱིས་མི་ཁྱབ་པའོ། །
en: It is inconceivable in terms of the categories of language.

source: ངེས་པར་བསྟན་པས་མཐའ་ཡས་པའོ། །
en: It is limitless in terms of instructions.

source: རྣམ་པར་གདོན་མི་ཟ་བས་ཚད་མེད་པའོ། །
en: It is immeasurable in terms of lacking all doubt.

source: བཤད་པས་ཐུག་པ་མེད་པའོ། །
en: It is infinite in terms of explanation.

source: གཞོལ་བར་འཇུག་པས་ཆགས་པ་མེད་པའོ། །
en: It is without attachment in terms of engagement.

source: རིགས་ཀྱི་བུ་དེ་ལ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་གང་ཞེ་ན།
en: (2) “Son of noble family, you may then ask, ‘What is the inexhaustible basket dhāraṇī?’

source: འདི་ལྟ་སྟེ། གཟུངས་ཀྱི་བསྟན་པ་མི་ཟད་པ་སྟེ།
en: It is the inexhaustible teaching of the dhāraṇī. The following teachings are inexhaustible:

source: གཟུགས་མི་རྟག་གོ་ཞེས་མི་རྟག་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on impermanence says, ‘Form is impermanent.’

source: གཟུགས་སྡུག་བསྔལ་ལོ་ཞེས་སྡུག་བསྔལ་བར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on suffering says, ‘Form is suffering.’

source: གཟུགས་བདག་མེད་པའོ་ཞེས་བདག་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of self says, ‘Form is without self.’

source: གཟུགས་ཞི་བའོ་ཞེས་ཞི་བར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on peace says, ‘Form is peace.’

source: གཟུགས་དབེན་པའོ་ཞེས་དབེན་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on voidness says, ‘Form is void.’

source: གཟུགས་དབུ་བ་རྡོས་པ་ལྟ་བུའོ་ཞེས་དབུ་བརྔོས་པ་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to a water bubble says, ‘Form is like a water bubble.’

source: གཟུགས་སྒྱུ་མ་ལྟ་བུའོ་ཞེས་སྒྱུ་མ་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to an illusion says, ‘Form is like an illusion.’

source: གཟུགས་སྨིག་རྒྱུ་ལྟ་བུའོ་ཞེས་སྨིག་རྒྱུ་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to a hallucination says, ‘Form is like a hallucination.’

source: གཟུགས་ཆུའི་ཟླ་བ་ལྟ་བུའོ་ཞེས་ཆུའི་ཟླ་བ་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to the moon’s reflection in water says, ‘Form is like the moon’s reflection in water.’

source: གཟུགས་རྨི་ལམ་ལྟ་བུའོ་ཞེས་རྨི་ལམ་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to a dream says, ‘Form is like a dream.’

source: གཟུགས་བྲག་ཅ་ལྟ་བུའོ་ཞེས་བྲག་ཅ་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to an echo says, ‘Form is like an echo.’

source: གཟུགས་མིག་ཡོར་ལྟ་བུའོ་ཞེས་མིག་ཡོར་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to an optical illusion says, ‘Form is like an optical illusion.’

source: གཟུགས་གཟུགས་བརྙན་ལྟ་བུའོ་ཞེས་གཟུགས་བརྙན་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on likeness to a reflection says, ‘Form is like a reflection.’

source: གཟུགས་ངོ་བོ་ཉིད་མེད་པའོ་ཞེས་ངོ་བོ་ཉིད་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of a nature says, ‘Form is natureless.’

source: གཟུགས་དངོས་པོ་མེད་པའོ་ཞེས་དངོས་པོ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of substantiality says, ‘Form is insubstantial.’

source: གཟུགས་གནས་མེད་པའོ་ཞེས་གནས་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of a ground says, ‘Form is groundless.’

source: གཟུགས་སྟོང་པའོ་ཞེས་སྟོང་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: “The teaching on emptiness says, ‘Form is empty.’

source: གཟུགས་མཚན་མ་མེད་པའོ་ཞེས་མཚན་མ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on signlessness says, ‘Form lacks conceptual signs.’

source: གཟུགས་སྨོན་པ་མེད་པའོ་ཞེས་སྨོན་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on wishlessness says, ‘Form lacks wishfulness.’

source: གཟུགས་མངོན་པར་འདུ་བྱེད་པ་མེད་པའོ་ཞེས་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of conditioning says, ‘Form lack conditioning.’

source: གཟུགས་མ་སྐྱེས་པའོ་ཞེས་མ་སྐྱེས་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on nonarising says, ‘Form is unarisen.’

source: གཟུགས་སྐྱེས་བ་མེད་པའོ་ཞེས་སྐྱེ་བ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of birth says, ‘Form is without arising.’

source: གཟུགས་སྔོན་གྱི་མཐར་ངོ་བོ་ཉིད་མེད་པའོ་ཞེས་སྔོན་གྱི་མཐར་ངོ་བོ་ཉིད་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: “The teaching on the lack of a nature in the beginning says, ‘Form is natureless in the beginning.’

source: གཟུགས་ཕྱི་མའི་མཐར་ངོ་བོ་ཉིད་མེད་པའོ་ཞེས་ཕྱི་མའི་མཐར་ངོ་བོ་ཉིད་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of a nature in the end says, ‘Form is natureless in the end.’

source: གཟུགས་བར་དུ་ངོ་བོ་ཉིད་མེད་པའོ་ཞེས་བར་དུ་ངོ་བོ་ཉིད་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of a nature in the meantime says, ‘Form is natureless in the meantime.’

source: གཟུགས་བར་དུ་ཞི་བའོ་ཞེས་བར་དུ་ཞི་བར་བསྟན་པ་མི་ཟད་པ་དང་།
en: “The teaching on peace says, ‘Form is peace.’

source: གཟུགས་ཉེ་བར་ཞི་བར་ཞི་བའོ་ཞེས་ཉེ་བར་ཞི་བར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on pacification says, ‘Form is pacified.’

source: གཟུགས་རྒྱུ་བ་མེད་པའོ་ཞེས་རྒྱུ་བ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of movement says, ‘Form is unmoving.’

source: གཟུགས་སྤྲོས་པ་མེད་པའོ་ཞེས་སྤྲོས་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of elaboration says, ‘Form is without elaboration.’

source: གཟུགས་བསམ་གྱིས་མི་ཁྱབ་པའོ་ཞེས་བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on inconceivability says, ‘Form is inconceivable.’

source: གཟུགས་མཚུངས་པ་མེད་པའོ་ཞེས་མཚུངས་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on being incomparable says, ‘Form is incomparable.’

source: གཟུགས་སེམས་ཅན་མེད་པའོ་ཞེས་སེམས་ཅན་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of sentient beings says, ‘Form is devoid of sentient beings.’

source: གཟུགས་སྲོག་མེད་པའོ་ཞེས་སྲོག་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on life says, ‘Form is devoid of life.’

source: གཟུགས་གསོ་བ་མེད་པའོ་ཞེས་གསོ་བ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on vitality says, ‘Form is devoid of vitality.’

source: གཟུགས་གང་ཟག་མེད་པའོ་ཞེས་གང་ཟག་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on individuals says, ‘Form is devoid of individuals.’

source: གཟུགས་བེམས་པོའོ་ཞེས་བེམས་པོར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the inanimate says, ‘Form is inanimate.’

source: གཟུགས་གཡོ་བ་མེད་པའོ་ཞེས་གཡོ་བ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of mobility says, ‘Form is devoid of mobility.’

source: གཟུགས་བྱེད་པ་མེད་པའོ་ཞེས་བྱེད་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the lack of agency says, ‘Form is devoid of agency.’

source: གཟུགས་རྩྭ་དང་། རྩིག་པ་དང་། ཤིང་དང་། བོང་བ་དང་། མིག་ཡོར་ལྟ་བུའོ་ཞེས་རྩྭ་དང་། རྩིག་པ་དང་། ཤིང་དང་། བོང་བ་དང་། མིག་ཡོར་ལྟ་བུར་བསྟན་པ་མི་ཟད་པ་དང་།
en: “The teaching on likeness to grass, walls, trees, dirt, and optical illusions says, ‘Forms are like grass, walls, trees, dirt, and optical illusions.’

source: གཟུགས་རྣམ་པར་བསྒྲུབས་པའི་མཚན་ཉིད་དོ་ཞེས་རྣམ་པར་བསྒྲུབས་པའི་མཚན་ཉིད་དུ་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on having the character of being established says, ‘Form has the character of being established.’

source: གཟུགས་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པའོ་ཞེས་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on coming about from the four great elements says, ‘Form comes about from the four great elements.’

source: གཟུགས་སྒྲ་མེད་པའོ་ཞེས་སྒྲ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of sound says, ‘Form is soundless.’

source: གཟུགས་རྣམ་པར་རིག་པ་མ་ཡིན་པའོ་ཞེས་རྣམ་པར་རིག་པ་མ་ཡིན་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on noncognition says, ‘Form is not cognition.’

source: གཟུགས་བརྗོད་དུ་མེད་པའོ་ཞེས་བརྗོད་དུ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on being inexpressible says, ‘Form is inexpressible.’

source: གཟུགས་རང་གི་ངང་གིས་ཡོངས་སུ་དག་པའོ་ཞེས་རང་གི་ངང་གིས་ཡོངས་སུ་དག་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on inherent purity says, ‘Form is inherently pure.’

source: གཟུགས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའོ་ཞེས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on dependent arising says, ‘Form is dependently arisen.’

source: གཟུགས་ཆད་པ་མེད་པའོ་ཞེས་ཆད་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: “The teaching on the absence of annihilation says, ‘Form is without annihilation.’

source: གཟུགས་རྟག་པ་མེད་པའོ་ཞེས་རྟག་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of permanence says, ‘Form has no permanence.’

source: གཟུགས་བྱེད་པ་པོ་མེད་པའོ་ཞེས་བྱེད་པ་པོ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of a creator says, ‘Form has no creator.’

source: གཟུགས་ཚོར་བ་པོ་མེད་པའོ་ཞེས་ཚོར་བ་པོ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of an experiencer says, ‘Form has no experiencer.’

source: གཟུགས་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་གྲུབ་པའོ་ཞེས་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་གྲུབ་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on being produced by the maturation of actions says, ‘Form has been produced by the maturation of actions.’

source: གཟུགས་ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པའོ་ཞེས་ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on being equal to the realm of phenomena says, ‘Form is equal to the realm of phenomena.’

source: གཟུགས་དེ་བཞིན་ཉིད་ལ་རབ་ཏུ་གནས་པའོ་ཞེས་དེ་བཞིན་ཉིད་ལ་རབ་ཏུ་གནས་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on abiding in suchness says, ‘Form abides in suchness.’

source: གཟུགས་ཡང་དག་པའི་མཐའ་ལ་རབ་ཏུ་གནས་པའོ་ཞེས་ཡང་དག་པའི་མཐའ་ལ་རབ་ཏུ་གནས་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on abiding at the limit of reality says, ‘Form abides at the limit of reality.’

source: གཟུགས་ངའི་བ་མེད་པའོ་ཞེས་ངའི་བ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of mineness says, ‘Form has nothing that is mine.’

source: གཟུགས་ཡོངས་སུ་འཛིན་པ་མེད་པའོ་ཞེས་ཡོངས་སུ་འཛིན་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the absence of apprehending says, ‘Form is without apprehending.’

source: གཟུགས་ཟིན་པ་མེད་པའོ་ཞེས་ཟིན་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on being endless says, ‘Form is endless.’

source: གཟུགས་ཚད་མེད་པའོ་ཞེས་ཚད་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on immeasurability says, ‘Form is immeasurable.’

source: གཟུགས་ཐུག་པ་མེད་པའོ་ཞེས་ཐུག་པ་མེད་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on infinity says, ‘Form is infinite.’

source: གཟུགས་བྱང་ཆུབ་ཀྱི་རང་བཞིན་ནོ་ཞེས་བྱང་ཆུབ་ཀྱི་རང་བཞིན་དུ་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on the nature of awakening says, ‘Form is of the nature of awakening.’

source: གཟུགས་ནམ་མཁའ་དང་མཉམ་པའོ་ཞེས་ནམ་མཁའ་དང་མཉམ་པར་བསྟན་པ་མི་ཟད་པ་དང་།
en: The teaching on equality with space says, ‘Form is equal to space.’

source: གཟུགས་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་ནོ་ཞེས་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་དུ་བསྟན་པ་མི་ཟད་པའོ། །
en: The teaching on the nature of nirvāṇa says, ‘Form is of the nature of nirvāṇa.’ These teachings are all inexhaustible.

source: དེ་བཞིན་དུ་ཕུང་པོ་རྣམས་དང་། ཁམས་རྣམས་དང་། སྐྱེ་མཆེད་རྣམས་དང་། མིང་གི་ཚོགས་དང་། ཚིག་གི་ཚོགས་དང་། ཡི་གེའི་ཚོགས་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་ཀྱི་བར་ལ་ཡང་སྒྲ་གཅིག་བརྗོད་པ་ལ་འཇུག་པས་བསྟན་པ་མི་ཟད་པ་ཤེས་པར་ཐམས་ཅད་ལ་རྒྱས་པར་སྦྱར་རོ། །
en: “Similarly, by engaging in uttering a single sound, inexhaustible teachings are extensively applied to all that can be known, including all phenomena, that is, the aggregates, the elements, the sense fields, the collections of names, the collections of terms, and the collections of letters.

source: འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ་ལུས་ཀྱི་ཟ་མ་ཏོག་འདིའི་མི་ཟད་པ་ཡོངས་སུ་བརྗོད་པ་ཤེས་པ་དང་། རིན་པོ་ཆེའི་ཟ་མ་ཏོག་ཆོས་ཀྱི་རྣམ་གྲངས་མི་ཟད་པ་ལ་འཇུག་པ་ཤེས་པ་དང་། བསྟན་པ་ཤེས་པ་མི་ཟད་པ་འདི་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཞེས་བྱ་སྟེ
en: The knowledge for expressing what is inexhaustible among this basket of a body arisen from the four great elements, the knowledge for entering into the inexhaustible Dharma discourses that are a basket of jewels, and the inexhaustible knowledge of the teachings are called the inexhaustible basket dhāraṇī.

source: གང་ཆུང་ཟད་འཇུག་པ་ཙམ་ཞིག་བསྟན་གྱིས། བསྐལ་པའམ་དེ་ལས་ལྷག་པར་ཡང་མི་ཟད་པའི་ཟ་མ་ཏོག་ཅེས་བརྗོད་དུ་ཡོད་དོ། །
en: Through the teaching of a mere introduction, the inexhaustible basket is uttered for an eon or more.

source: རིགས་ཀྱི་བུ་དེ་ལ་འཁྱིལ་བ་མཐའ་ཡས་ཀྱི་གཟུངས་གང་ཞེ་ན།
en: (3) “Son of noble family, you may then ask, ‘What is the limitless enfoldment dhāraṇī?’

source: མཐའ་ཞེས་བྱ་བ་ནི་ཆད་པ་དང་རྟག་པའོ། །
en: The ‘limits’ are nihilism and eternalism.

source: འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་པ་སྟེ།
en: The ‘enfoldment’ is the twelve links of dependent arising:

source: མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས།
en: Conditioned by ignorance, formations occur.

source: འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: Conditioned by formations, consciousness occurs.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས།
en: Conditioned by consciousness, name and form occur.

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །
en: Conditioned by name and form, the six sense fields occur.

source: སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ།
en: Conditioned by the six sense fields, contact occurs.

source: རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ།
en: Conditioned by contact, sensation occurs.

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ།
en: Conditioned by sensation, craving occurs.

source: སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ།
en: Conditioned by craving, appropriation occurs.

source: ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ།
en: Conditioned by appropriation, becoming occurs.

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ།
en: Conditioned by becoming, birth occurs.

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ
en: Conditioned by birth, there occur old age, death, sorrow, lamentation, suffering, unhappiness, and chaos.

source: དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འདི་འབའ་ཞིག་འགྱུར་བར་འགྱུར་རོ། །
en: In that manner, nothing but this great heap of sorrow occurs.

source: དེ་ལ་སྔགས་ཀྱི་དགོངས་པ་མཐའ་ཡས་པ་དང་། སྔགས་བསྟན་པའི་སྒོ་མཐའ་ཡས་པ་དང་། གཞོལ་བར་འཇུག་པ་མཐའ་ཡས་པ་འདི་ནི། འཁྱིལ་བ་མཐའ་ཡས་པའི་གཟུངས་ཤེས་པའོ། །མཐའ་ཞེས་བྱ་བ་ནི་ལེན་པ་དང་འདོར་བའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་མི་ལེན་མི་འདོར་བའོ། །
en: The infinite intent of the formula, the infinite doors to its expositions, and its infinite introductions provide knowledge of the limitless enfoldment dhāraṇī.

source: མཐའ་ཞེས་བྱ་བ་ནི་སྐྱེ་བ་དང་འགགས་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་སྐྱེ་བ་མེད་པ་དང་འགགས་པ་མེད་པའོ། །
en: “The ‘limits’ are birth and cessation, whereas ‘enfoldment’ is beyond birth and cessation.

source: མཐའ་ཞེས་བྱ་བ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་དང་རྣམ་པར་བྱང་བའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་རང་བཞིན་གྱིས་རྣམ་པར་དག་པའོ། །
en: The ‘limits’ are pollution and purification, whereas ‘enfoldment’ is natural purity.

source: མཐའ་ཞེས་བྱ་བ་ནི་མཚན་མ་དང་སྤྲོས་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་ཀུན་དུ་འབྱུང་བ་མེད་པའོ། །
en: The ‘limits’ are discursive signs and elaborations, whereas ‘enfoldment’ is their lack of origination.

source: མཐའ་ཞེས་བྱ་བ་ནི་རྟོག་པ་དང་རྣམ་པར་རྟོག་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་རྟོག་པ་མེད་པ་དང་། རྣམ་པར་རྟོག་པ་མེད་པའོ། །
en: The ‘limits’ are thoughts and conceptualization, whereas ‘enfoldment’ is beyond thoughts and conceptualization.

source: མཐའ་ཞེས་བྱ་བ་ནི་རྒྱུ་དང་ལྟ་བའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་རྒྱུ་དང་ལྟ་བ་ཡོངས་སུ་ཤེས་པའོ། །
en: The ‘limits’ are causes and views, whereas ‘enfoldment’ is comprehension of causes and views.

source: མཐའ་ཞེས་བྱ་བ་ནི་མིང་དང་གཟུགས་སོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་རྣམ་པར་རིག་བྱེད་མ་ཡིན་པའོ། །
en: The ‘limits’ are name and form, whereas ‘enfoldment’ does not form cognitive representations.

source: མཐའ་ཞེས་བྱ་བ་ནི་འདུས་བྱས་དང་འདུས་མ་བྱས་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་འཁོར་གསུམ་ཡོངས་སུ་དག་པའོ། །
en: The ‘limits’ are the conditioned and the unconditioned, whereas ‘enfoldment’ consists in the purity of all three spheres of agent, act, and object.
